<a href="https://colab.research.google.com/github/AlexanderA28/Pong/blob/master/EDA-Project.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
import pandas as pd

calendar = pd.read_csv('calendar.csv')

calendar['d_num'] = calendar['d'].map(lambda x: x.split('_'))

calendar['d_num'] = calendar['d_num'].map(lambda x: x[1])

calendar['d_num']

calendar.head()

sales_train_validation = pd.read_csv('sales_train_validation.csv')

sell_prices = pd.read_csv('sell_prices.csv')

sell_prices

       store_id          item_id  wm_yr_wk  sell_price
0          CA_1    HOBBIES_1_001   11325.0        9.58
1          CA_1    HOBBIES_1_001   11326.0        9.58
2          CA_1    HOBBIES_1_001   11327.0        8.26
3          CA_1    HOBBIES_1_001   11328.0        8.26
4          CA_1    HOBBIES_1_001   11329.0        8.26
...         ...              ...       ...         ...
236908     CA_1  HOUSEHOLD_1_495   11509.0        3.74
236909     CA_1  HOUSEHOLD_1_495   11510.0        3.74
236910     CA_1  HOUSEHOLD_1_495   11511.0        3.74
236911     CA_1  HOUSEHOLD_1_495   11512.0        3.74
236912     CA_1                H       NaN         NaN

[236913 rows x 4 columns]

In [0]:
df = sales_train_validation.melt(id_vars=['id','item_id','dept_id','cat_id','store_id','state_id'])

In [0]:
df.rename(columns ={'variable':'day','value':'volume'}, inplace=True)

In [0]:
df['d_num'] = df['day'].map(lambda x: x.split('_'))

In [0]:
df['d_num'] = df['d_num'].map(lambda x: x[1])

In [18]:
df.head()

                              id        item_id    dept_id  ...  day volume d_num
0  HOBBIES_1_001_CA_1_validation  HOBBIES_1_001  HOBBIES_1  ...  d_1    0.0     1
1  HOBBIES_1_002_CA_1_validation  HOBBIES_1_002  HOBBIES_1  ...  d_1    0.0     1
2  HOBBIES_1_003_CA_1_validation  HOBBIES_1_003  HOBBIES_1  ...  d_1    0.0     1
3  HOBBIES_1_004_CA_1_validation  HOBBIES_1_004  HOBBIES_1  ...  d_1    0.0     1
4  HOBBIES_1_005_CA_1_validation  HOBBIES_1_005  HOBBIES_1  ...  d_1    0.0     1

[5 rows x 9 columns]